42crunch.vscode-openapi
anysphere.cursorpyright
batisteo.vscode-django
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
eg2.vscode-npm-script
eriklynd.json-tools
esbenp.prettier-vscode
formulahendry.auto-rename-tag
humao.rest-client
jasonnutter.search-node-modules
kevinrose.vsc-python-indent
leizongmin.node-module-intellisense
mechatroner.rainbow-csv
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
njpwerner.autodocstring
njqdev.vscode-python-typehint
qwtel.sqlite-viewer
rangav.vscode-thunder-client
redhat.vscode-yaml
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
wholroyd.jinja
xabikos.javascriptsnippets
yzhang.markdown-all-in-one
